tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ansible"
brew "awscli"
brew "bat"
brew "broot"
brew "cfn-lint"
brew "cowsay"
brew "git"
brew "git-secrets"
brew "htop"
brew "jq"
brew "mas"
brew "packer"
brew "serverless"
brew "terraform"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "aws/tap/aws-sam-cli"
cask "anki"
cask "anydesk"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "cyberduck"
cask "dash"
cask "dashlane"
cask "discord"
cask "docker"
cask "figma"
cask "fliqlo"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "maccy"
cask "macmediakeyforwarder"
cask "microsoft-teams"
cask "notion"
cask "numi"
cask "postman"
cask "powershell"
cask "slack"
cask "spotify"
cask "tableplus"
cask "teamviewer"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webex"
cask "whatsapp"
cask "wireshark"
cask "zoom"
cask "tastyworks"
cask "remnote"

mas "Be Focused", id: 973134470
mas "Deliveries", id: 290986013
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641

# mas "Accelerate", id: 1459809092
# mas "Adblock Plus", id: 1432731683
# mas "OneTab", id: 1540160809
# mas "Rakuten Cash Back", id: 1451893560
