tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Platform built on V8 to build network applications
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# New way to see and navigate directory trees
brew "broot"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Convert AWS CloudFormation templates between JSON and YAML formats
brew "cfn-flip"
# Configurable talking characters in ASCII art
brew "cowsay"
# Checks CloudFormation templates for compliance using a declarative syntax
brew "cloudformation-guard"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Configurable static site generator
brew "hugo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Administration and development platform for PostgreSQL
brew "pgadmin4"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# File browser
brew "ranger"
# Build applications with serverless architectures
brew "serverless"
# Tool to build, change, and version infrastructure
brew "terraform"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Password manager
brew "pass"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Terminal sharing over the Internet
brew "tty-share"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# General-purpose speech recognition model
brew "openai-whisper"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Communications service
cask "amazon-chime"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Web browser
cask "firefox"
# Server and cloud storage browser
cask "cyberduck"
# AirPods companion app
cask "airbuddy"
# API documentation browser and code snippet manager
cask "dash"
# Chromium based browser
cask "arc"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# Kubernetes and container management on the desktop
cask "rancher"
# Pack, ship and run any application as a lightweight container
cask "docker"
# Control your tools with a few keystrokes
cask "raycast"
# Flip clock screensaver
cask "fliqlo"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides access to camera controls
cask "logitech-camera-settings"
# Software for Logitech devices
cask "logi-options-plus"
# Clipboard manager
cask "maccy"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Spaced-repetition powered note-taking tool
cask "remnote"
# Calculator and converter application
cask "numi"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Presentation and production application for live events
cask "propresenter"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Desktop trading platform for the tastyworks brokerage
cask "tastytrade"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Remote pair programming
cask "pop"
mas "Dashlane", id: 517914548
mas "Deliveries", id: 290986013
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "Rakuten Cash Back", id: 1451893560
mas "Spark", id: 1176895641
mas "Grammarly for Safari", id: 1462114288
mas "Balance: Mindful time tracking", id: 1637311725
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598

# REMOVED APPLICATIONS # 
# Meet, chat, call, and collaborate in just one place
# cask "microsoft-teams"
# Desktop client for WhatsApp
# cask "whatsapp"
# Mind mapping and brainstorming tool
# cask "xmind"
# Multi-platform VNC client and server
# cask "tigervnc-viewer"
# Allows connection to a computer remotely
# cask "anydesk"
# Emacs dependency management
# brew "cask"
# Download YouTube videos from the command-line
# brew "youtube-dl"
# Desktop client for GitHub repositories
# cask "github"
# HTTP and GraphQL Client
# cask "insomnia"
# GitHub command-line tool
# brew "gh"

# mas application uninstalled
# mas "Accelerate", id: 1459809092
# mas "Adblock Plus", id: 1432731683
# mas "Amphetamine", id: 937984704
# mas "Be Focused", id: 973134470
